RITRacingSoftware/BMS/src/driver/HAL_SlaveChips/STM32_HAL_SlaveChips.c
		data_counter=data_counter+2;												//Because the transmitted PEC code is 2 bytes long the data_counter
																					//must be incremented by 2 bytes to point to the next ICs gpio voltage data
	}
  }
  free(data);
  return (pec_error);
}

//Function that reads the cell voltages for all of the cells
//voltages: pointer to where cell voltages will be put
//chips: the number of LTC6904s chained together or total number of cells/12
static bool read_All_Cell_Voltages(float* voltages, int chips){
    //May need to run ADCV command to read cell voltages first, and wait for them to be read
    bool error = false;
    char transmitCommand[4];
    for(int i = 0; i++; i < 4) //Cycle through each register group (A,B,C,D)
    {
        transmitCommand[0] = ReadVoltagesCMD0[i];
        transmitCommand[1] = ReadVoltagesCMD1[i];
        //NEED TO IMPLEMENT PEC
        //transmitCommand[2] and [3], for PEC0 and PEC1
        char *cellVoltagesRecieved[6*chips];
        Error_t spiError = HAL_Spi_transmit_and_receive(&transmitCommand[0], 4, cellVoltagesRecieved[0], 6*chips); //not sure about thisPin
        error = spiError.active;
        for(int x = 0; x++; x < chips) //Cycle through each of the LTC boards in daisychain
        {
            for(int y = 0; y++; y < 3)
            {
                //Cell Voltage for Cell x = CxV • 100µV 
                float thisVoltage = ((float) (cellVoltagesRecieved[(x*6)+(y*2)] && (*(cellVoltagesRecieved[(x*6)+(y*2)+1])<<8)))/((float)10000);
                //memcpy(voltages[(i*6)+(x*12*2)+(y*2)], &thisVoltage, 1);
                voltages[(i*6)+(x*12*2)+(y*2)] = thisVoltage;
            }
            //strncpy(&voltages[(i*6) + (x*(12*2))], &cellVoltagesRecieved[x*6], 6); //Copy the group values to the voltage values
        }

    }
    return error;
}

//Function that reads the is_draining state for all of the cells
//is_draining: pointer to where is_draining states will be put
//return: true if PEC error or spi error, false otherwise
static bool read_All_Is_Draining(bool* is_draining, unsigned int chips)
{
    bool error = false;
    char transmitCommand[4];
    transmitCommand[0] = 0xFF & (READ_CONFIGURATUION_REGISTER_GROUP >> 8);
    transmitCommand[1] = 0xFF & (READ_CONFIGURATUION_REGISTER_GROUP);
    //NEED TO IMPLEMENT PEC
    uint16_t commandPEC = pec15_calc(2, transmitCommand);
    transmitCommand[2] = (0xFF00 & commandPEC) >> 8;
    transmitCommand[3] = (0xFF & commandPEC);
    //transmitCommand[2] and [3] for PEC0 and PEC1
    char configurationRegisters[8*chips];
    //Read the Configuration Register Group to get DCC
    wakeup_idle();
    Error_t spiError = HAL_Spi_transmit_and_receive(transmitCommand, 4, configurationRegisters, 8*chips);
    error = spiError.active;
    for(int i = 0; i < chips; i++) //Cycle through data for ech daisy-chained LTC
    {
        //Set bits in bit array
        is_draining[(i*12)] =  (configurationRegisters[(i*8)+4] & (0x1 << 1)) != 0;
        is_draining[(i*12)+1] =  (configurationRegisters[(i*8)+4] & (0x1 << 2)) != 0;
        is_draining[(i*12)+2] =  (configurationRegisters[(i*8)+4] & (0x1 << 3)) != 0;
        is_draining[(i*12)+3] =  (configurationRegisters[(i*8)+4] & (0x1 << 4)) != 0;
        is_draining[(i*12)+4] =  (configurationRegisters[(i*8)+4] & (0x1 << 5)) != 0;
        is_draining[(i*12)+5] =  (configurationRegisters[(i*8)+4] & (0x1 << 6)) != 0;
        is_draining[(i*12)+6] =  (configurationRegisters[(i*8)+4] & (0x1 << 7)) != 0;
        is_draining[(i*12)+7] =  (configurationRegisters[(i*8)+4] & (0x1 << 8)) != 0;
        is_draining[(i*12)+8] =  (configurationRegisters[(i*8)+5] & (0x1 << 1)) != 0;
        is_draining[(i*12)+9] =  (configurationRegisters[(i*8)+5] & (0x1 << 2)) != 0;
        is_draining[(i*12)+10] = (configurationRegisters[(i*8)+5] & (0x1 << 3)) != 0;
        is_draining[(i*12)+11] =  (configurationRegisters[(i*8)+5] & (0x1 << 4)) != 0;
        uint16_t pec_expected = pec15_calc(6, &configurationRegisters[i*8]);
        uint16_t pec_recieved =  (configurationRegisters[(i*8)+6] ||  (configurationRegisters[(i*8)+7] << 8));
        if(pec_expected != pec_recieved){
            error = true;
        }
    }
    return error;

}


void HAL_SlaveChips_init(){
    HAL_Spi_init();
    set_adc(ADC_MODE, DCP_VALUE, CH_VALUE, CHG_VALUE);
    #if FREERTOS_TIMING == 0
    initTimer();
    #endif
//     Using it:
//     TIM6->ARR = val;
//     TIM6->EGR |= TIM_EGR_UG;
//     TIM6->SR = 0;
//     TIM6->CR1 |= TIM_CR1_CEN;
}

//Masks for broadcast command format
//CMD0 = CC & 0x700
//CMD1 = CC & 0xFF

//DCC[x]: Discharge cell X, x = 1 - 12, 1->turn on short switching for cell x, 0->turn off short switching for cell x
//DCC in configuration register group
Error_t HAL_SlaveChips_get_all_cell_data(float* voltages, bool* is_draining, unsigned int num_cells_to_set)
{
    Error_t error;
    error.active = false;
    LTC6804_adcv();
    //LTC6804_adcv();
    
    //WAIT 2335 us for ADC conversion
    #if FREERTOS_TIMING == 0
    TIM6->ARR = 2500; //Need to wait 2335 micro seconds, rounded up to 2500 for now
    TIM6->EGR |= TIM_EGR_UG;
    TIM6->SR = 0;
    TIM6->CR1 |= TIM_CR1_CEN;
    while(TIM6->SR == 0);
    #else
    vTaskDelay(3);
    #endif
    

    // const uint8_t cells_per_board = 15;
    const uint8_t chips_per_board = NUM_CHIPS_PER_BOARD;
    // uint8_t num_boards = num / cells_per_board;

    //Array of cell codes
    uint16_t AllCellVoltages[NUM_CHIPS][12]; //Make sure if num_cells_to_set isn't a multiple of 12, array is big enough
    
    bool AllIsDraining[num_cells_to_set];

    // TODO- change this to total # of slave chips once on full BMS
    int pec = LTC6804_rdcv(0, NUM_CHIPS, AllCellVoltages);
    // if(read_All_Is_Draining(AllIsDraining, num_boards)){
    //     error.active = true;
    // }

    if (pec == 1)
    {
        error.active = true;
    }
   // float oops = (float) AllCellVoltages[0][0] / 10000.0;

    //TODO - Change number of cells for each chip if it changes
    for (int board = 0; board < NUM_BOARDS; board++)
    { 
        // chip 1
        for (int cell = 0; cell < NUM_CELLS_CHIP_1; cell++)
        {
            //TODO - Adjust cell pins if it changes
            int cell_pin = cell;
            if (cell > 4)
            {
              cell_pin += 1;
            }

            voltages[board*NUM_CELLS_PER_BOARD+cell] = ((float)(AllCellVoltages[board*chips_per_board][cell_pin])) / 10000.0;
        }

        // chip 2
        for (int cell = 0; cell < NUM_CELLS_CHIP_2; cell++)
        {
            int cell_pin = cell;
            if (cell > 3)
            {
                cell_pin += 2;
            }

            voltages[board*NUM_CELLS_PER_BOARD+cell+NUM_CELLS_CHIP_1] = ((float) AllCellVoltages[board*chips_per_board+1][cell_pin]) / 10000.0;
        }
   
