RITRacingSoftware/BMS/src/driver/HAL_SlaveChips/STM32_HAL_SlaveChips.c
    }

    

    return error;
}

//Every LTC has 3 thermistors
Error_t HAL_SlaveChips_get_all_tm_readings(float* temperatures, float* vref2s, unsigned int num){
    Error_t error;
    error.active = false;
    //GPIO voltage in Auxilary Register Group A
    LTC6804_adax();

    //WAIT for ADC conversion
    #if FREERTOS_TIMING == 0
    TIM6->ARR = 2500; //Need to wait 2335 seconds, rounded up to 2500 for now
    TIM6->EGR |= TIM_EGR_UG;
    TIM6->SR = 0;
    TIM6->CR1 |= TIM_CR1_CEN;
    while(TIM6->SR == 0);
    #else
    vTaskDelay(3);
    #endif

    //NEED TO IMPLEMENT PEC
    // uint8_t setsOfTwelve = ((num / 3) * 2);
    // if(setsOfTwelve == 0){
    //   setsOfTwelve = 2;
    // }
    
    // uint8_t num_boards = num / therm_per_board;
    // uint8_t num_chips = num_boards * 2;
    //NEED TO IMPLEMENT PEC
    //transmitCommand[2] and [3] for PEC0 and PEC1

    //Array for the auxilary register codes received back over SPI from the LTC chips
    uint16_t tempRecieved[NUM_CHIPS][6];

    //Read the Auxilary Register A to get temperature readings from every chip 
    if(LTC6804_rdaux(0, NUM_CHIPS, tempRecieved) == -1){
        error.active = true;
    }

    //Iterate through the data for each chip and set the temperature data from each chip
    for (int r = 0; r < NUM_CHIPS; r++)
    {
        for (int c = 0; c < NUM_THERMISTORS_PER_CHIP; c++)
        {
            temperatures[r*NUM_THERMISTORS_PER_CHIP + c] =  (((float) tempRecieved[r][c]) / LTC6804_ADC_MAX_VALUE) * LTC6804_ADC_RANGE_V;
        }
        vref2s[r] = (((float)tempRecieved[r][5])/LTC6804_ADC_MAX_VALUE) * LTC6804_ADC_RANGE_V;
    }

    return error;
}

// static uint8_t drain_state_LUT[] = {9, 8, 7, 6, 3, 2, 1, 0};

Error_t HAL_SlaveChips_request_cell_drain_state(bool* cells, unsigned int num)
{
    // Our goal with this function is to go from 'cells', an array of booleans, one for each cell...
    // And construct the dcc bytes for the cell drain request message.

    const int chips_per_board = NUM_CHIPS/NUM_BOARDS;

    // this is our output
    uint16_t dcc_regs[NUM_BOARDS][chips_per_board];

    //Set all to 0
    for (int r = 0; r < NUM_BOARDS; r++)
    {
        for (int c = 0; c < chips_per_board; c++)
        {
            dcc_regs[r][c] = 0;
        }
    }

    //Set whether each cell should be draining
    for (int cell_no = 0; cell_no < num; cell_no++)
    {
        // what segment is this cell on?
        int seg_index = cell_no / NUM_CELLS_PER_BOARD;

        // what index cell is this on the given segment?
        int cell_seg_index = cell_no % NUM_CELLS_PER_BOARD;

        // which chip of the two on the segment is this cell connected to?
        int chip_index;
        if (cell_seg_index < (NUM_CELLS_PER_BOARD/2))
        {
            chip_index = 0;
        }
        else
        {
            chip_index = 1;
        }

        // now get the cell index on the chip
        int chip_cell_index;
        if (chip_index == 0)
        {
            chip_cell_index = cell_seg_index;
        }
        else
        {
            chip_cell_index = cell_seg_index - (NUM_CELLS_PER_BOARD/2);
        }

        // now convert to the pin index on the chip
        // you'd think this is the same as chip_cell_index but its not because there's a few spots on each chip we didn't populate
        int chip_pin_index;
        if (chip_cell_index > 4)
        {
            // account for the gap
            chip_pin_index = chip_cell_index + 1;
        }
        else
        {
            chip_pin_index = chip_cell_index;
        }

        // if the cell has been requested to start draining
        if (cells[cell_no] == true)
        {
            // set the corresponding bit in the byte that will later be part of the request
            dcc_regs[seg_index][chip_index] |= (1 << chip_pin_index);
        }
    }

    Error_t error;
    error.active = false;
    // int num_chips = num_seg * 2;
  
    //Construct the needed SPI command structure
    char tx[4 + ((NUM_CHIPS) * 8)]; //CMD0, CMD1, PEC0, PEC1, 6 bytes of data and 2 bytes PEC for each set of 12
    tx[0] = 0;
    tx[1] = WRITE_CONFIGURATION_REGISTER_GROUP && 0xFF;//(WRITE_CONFIGURATION_REGISTER_GROUP >> 8) && 0xFF;
    tx[2] = WRITE_CONFIGURATION_REGISTER_PEC0;
    tx[3] = WRITE_CONFIGURATION_REGISTER_PEC1;
    //Set other parameters of Configuration Register
    //Alternative way, could be to read the register, and only change needed bits, but would take longer
    char ByteOne = 0xF8; //GPIO pins, and some others, all set to default
    char ByteTwo = 0x00; //Under voltage comparison , set to default
    char ByteThree = 0x00; //Under Voltage comparison and over voltage comparison
    char ByteFour = 0x00; //Over Voltage Comparison, set to default
  
    const int bytes_per_chip = 8;
    //Put whether each cell should drain in the SPI command
    for (int chip_index = 0; chip_index < NUM_CHIPS; chip_index++)
    {
        // where the chip specific message begins in the tx buffer
        int chip_base = 4 + (NUM_CHIPS-1-chip_index) * bytes_per_chip;
        tx[chip_base] = ByteOne;
        tx[chip_base + 1] = ByteTwo;
        tx[chip_base + 2] = ByteThree;
        tx[chip_base + 3] = ByteFour;
        
        uint16_t dcc = dcc_regs[chip_index / 2][chip_index % 2];
        tx[chip_base + 4] = (char)(dcc & 0xFF);
        tx[chip_base + 5] = (char)((dcc >> 8) & 0xFF);

        uint16_t pec = pec15_calc(6, &tx[chip_base]);
        tx[chip_base + 6] = (char) ((pec >> 8) & 0xFF);
        tx[chip_base + 7] = (char) (pec & 0xFF);
    }
    char show_tx[100];
    //Transmit the command to all of the chips over SPI
    for (int i = 0; i < sizeof(tx)/sizeof(tx[0]); i++) show_tx[i] = tx[i];
    char *rx;
    wakeup_idle();
    wakeup_idle();
    HAL_Spi_transmit_and_receive(tx, 4 + (NUM_CHIPS * bytes_per_chip), rx, 0);
    //TO DO: add error checking
    return error;
}
